barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/hal_radio.c
/**
  ******************************************************************************
  * @file    hal_radio.c 
  * @author  William Liang
  * @version V1.0.0
  * @date    09/10/2013
  * @brief   This file contains the initialization and handle of the radio frequency.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdlib.h>
#include "hal_radio.h"
#include "hal_uart.h"

#include "sx1276-LoRaMisc.h"
#include "sx1276-LoRa.h"
#include "hal_timer.h"
#include "stm32f0xx_spi.h"
#include "phy.h"
#include "sx1276-Fsk.h"
#include "hal_led.h"
#include "gpio_per.h" 

//#include "hal_fsk_sen.h"
//#include "MAC.h"
//#include "sx1276.h"
//#include "hal_flash.h"
//#include "hal_wdg.h"
//#include "hal_eeprom.h"


typedef enum
{
  START_645_POINT       = 0,
  ADDR_645_POINT        = 1,
  CONTROL_645_POINT     = 8,
  DATA_LENGTH_645_POINT = 9,
  DATA_MARK_645_POINT   = 10,
  DATA_PACKET_645_POINT = 14
}em_645_point;


/** @addtogroup RADIO
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/


extern sRF_FSK g_fsk ;
extern st_RF_LoRa_DypeDef g_RF_LoRa;
extern RN8209C_PARAM rn8209c_papameter;
extern u8 tedtbuf[];

struct etimer timer_rf; 

u8 local_addr[6]    = {0x0b, 0x9a, 0x09, 0x03, 0x00, 0x11};
u8 bordcast_addr[6] = {0x99, 0x99, 0x99, 0x99, 0x99, 0x99};

u8 cmd_op_light[4]  = {0x34, 0x33, 0x33, 0x93}; //写操作，开关，调光
u8 cmd_read_data[4] = {0x42, 0x33, 0x33, 0x94}; //读数据，读所有数据
u8 cmd_broadcast[4] = {0x34, 0x33, 0x33, 0x9c}; //广播控制

/* 不同为0， 相同为1 */
u8 cmp(u8 * buf1, u8* buf2, u8 length)
{
  for (u8 i = 0; i < length; i++)
  {
     if ( buf1[i] != buf2[i] )
     {
       /* 不同 */
       return 0;
     }
  }
    /* 相同 */
   return 1;
}


void  analyze_645_packet(u8 * buf)
{
}


void apl_ProcessRadioCmd()
{
  u8 pwm_light;
  u8 len_645;
  u8 info_sourceadd[18];
  u32 temp_light_time;
  
  /* 645 解析 */
  if ((g_RF_LoRa.rf_DataBuffer[START_645_POINT] == 0x68) && (g_RF_LoRa.rf_DataBuffer[START_645_POINT + 7] == 0x68) && 
       (g_RF_LoRa.rf_DataBuffer[ g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 11] == 0x16))
  {
     if (getSum(g_RF_LoRa.rf_DataBuffer, 10 + g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT]) == g_RF_LoRa.rf_DataBuffer[g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 10])
     {
       len_645 = g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 12;
       MemCpy( info_sourceadd, &g_RF_LoRa.rf_DataBuffer[len_645],  18);
       /* 下行帧 */
       if ( (g_RF_LoRa.rf_DataBuffer[CONTROL_645_POINT] & 0x80) == 0)
       {
          if ( (cmp(local_addr, &g_RF_LoRa.rf_DataBuffer[ADDR_645_POINT] , 6) == 1) 
              || (cmp(bordcast_addr, &g_RF_LoRa.rf_DataBuffer[ADDR_645_POINT] , 6) == 1) )
          {
              switch (g_RF_LoRa.rf_DataBuffer[CONTROL_645_POINT] & 0x1F)
              {
                  case 0x14:  // 控制码 写数据，点控
                    if ( (cmp(cmd_op_light, &g_RF_LoRa.rf_DataBuffer[DATA_MARK_645_POINT] , 4) == 1) )
                    {
                      pwm_light = g_RF_LoRa.rf_DataBuffer[DATA_PACKET_645_POINT] - 0x33;
                      
                      if ( pwm_light == 0)
                      {
                        close_light();
                        set_PWM(pwm_light);
                      }
                      else 
                      {
                        open_light();
                        set_PWM(pwm_light);
                      }
                      
                      /*
                      MemCpy( g_RF_LoRa.rf_DataBuffer, g_RF_LoRa.rf_DataBuffer,  8);
                      */
                       
                      g_RF_LoRa.rf_DataBuffer[8]           = g_RF_LoRa.rf_DataBuffer[CONTROL_645_POINT] | 0x80;
                      g_RF_LoRa.rf_DataBuffer[9]           = 0x04;
                      MemCpy( &g_RF_LoRa.rf_DataBuffer[10], cmd_op_light,  4);
                      g_RF_LoRa.rf_DataBuffer[ g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 10 ] = getSum(g_RF_LoRa.rf_DataBuffer, 10 + g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT]); 
                      g_RF_LoRa.rf_DataBuffer[ g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 11] = 0x16;
                      
                      MemCpy( &g_RF_LoRa.rf_DataBuffer[ g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 12], info_sourceadd,  6);      //信息域
                      
                      MemCpy( &g_RF_LoRa.rf_DataBuffer[ g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 18], info_sourceadd + 12,  6); //信息域
                      
                      MemCpy( &g_RF_LoRa.rf_DataBuffer[ g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 24], info_sourceadd + 6,  6); //信息域
                      
                      SX1276LoRa_Send_Packet(g_RF_LoRa.rf_DataBuffer, g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 12 + 18);
                      
                    }
                    
                    else  if ( (cmp(cmd_broadcast, &g_RF_LoRa.rf_DataBuffer[DATA_MARK_645_POINT] , 4) == 1) ) //群控
                    {
                        pwm_light = g_RF_LoRa.rf_DataBuffer[DATA_PACKET_645_POINT] - 0x33;

                        if ( pwm_light == 0)
                        {
                          close_light();
                          set_PWM(pwm_light);
                        }
                        else 
                        {
                          open_light();  
                          set_PWM(pwm_light);
                        }
                    }
                   
                  break;

