barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/hal_radio.c
                  case 0x11: // 控制码 读数据，点控
                    if ((cmp(cmd_read_data, &g_RF_LoRa.rf_DataBuffer[DATA_MARK_645_POINT] , 4) == 1))
                    {
                        if ( (cmp(cmd_read_data, &g_RF_LoRa.rf_DataBuffer[DATA_MARK_645_POINT] , 4) == 1) )
                        {
                            /*
                            MemCpy( g_RF_LoRa.rf_DataBuffer, g_RF_LoRa.rf_DataBuffer,  8);
                            */
                            g_RF_LoRa.rf_DataBuffer[8]           = g_RF_LoRa.rf_DataBuffer[CONTROL_645_POINT] | 0x80;
                            g_RF_LoRa.rf_DataBuffer[9]           = 0x1c;
                            MemCpy( &g_RF_LoRa.rf_DataBuffer[10], cmd_read_data,  4);
                            
                            g_RF_LoRa.rf_DataBuffer[14]          = rn8209c_papameter.pwmValue ; /*pwm value*/

                            g_RF_LoRa.rf_DataBuffer[15]          = 0;
                            g_RF_LoRa.rf_DataBuffer[16]          = 0;
                            g_RF_LoRa.rf_DataBuffer[17]          = 0;         
                            g_RF_LoRa.rf_DataBuffer[18]          = 0; //worning
                            
                           
                            if (rn8209c_papameter.pwmValue == 0)
                            {
                                 rn8209c_papameter.Uv = 0;          //关灯，回复确认值
                                 rn8209c_papameter.Ia = 0;   
                                 rn8209c_papameter.Pa = 0;
                                 
                            }
                            else
                            {
                                 Delayms(20);
                                 read_UIP(); //亮灯，读计量
                            }
                            
                            
                            g_RF_LoRa.rf_DataBuffer[19]          = (u8)(rn8209c_papameter.Uv & 0xFF);
                            g_RF_LoRa.rf_DataBuffer[20]          = (u8)((rn8209c_papameter.Uv >>8) & 0xFF); //voltage
                            
                            
                            g_RF_LoRa.rf_DataBuffer[21]          = (u8)(rn8209c_papameter.Ia & 0xFF);
                            g_RF_LoRa.rf_DataBuffer[22]          = (u8)((rn8209c_papameter.Ia >>8) & 0xFF); 
                            g_RF_LoRa.rf_DataBuffer[23]          = (u8)((rn8209c_papameter.Ia >>16) & 0xFF);        
                            g_RF_LoRa.rf_DataBuffer[24]          = (u8)((rn8209c_papameter.Ia >>24) & 0xFF); //current
                            
                           
                            g_RF_LoRa.rf_DataBuffer[25]          = (u8)(rn8209c_papameter.Pa & 0xFF); 
                            g_RF_LoRa.rf_DataBuffer[26]          = (u8)((rn8209c_papameter.Pa >>8) & 0xFF); //power
                            
                            if (rn8209c_papameter.pwmValue == 0)
                            {
                              g_RF_LoRa.rf_DataBuffer[27]        = 0;
                            }
                            else
                            {
                              g_RF_LoRa.rf_DataBuffer[27]        = read_pow_factor(); //功率因数
                            }
                            
                            g_RF_LoRa.rf_DataBuffer[28]          = 0; 
                            g_RF_LoRa.rf_DataBuffer[29]          = 0; //温度
                            
                            read_8209c_energyP();
                            g_RF_LoRa.rf_DataBuffer[30]          = 0;
                            g_RF_LoRa.rf_DataBuffer[31]          = 0;
                            g_RF_LoRa.rf_DataBuffer[32]          = 0;         
                            g_RF_LoRa.rf_DataBuffer[33]          = 0; //电量
                            
                            temp_light_time = get_light_time();
                            g_RF_LoRa.rf_DataBuffer[34]          = (u8)(temp_light_time & 0xFF);;
                            g_RF_LoRa.rf_DataBuffer[35]          = (u8)((temp_light_time >>8) & 0xFF);
                            g_RF_LoRa.rf_DataBuffer[36]          = (u8)((temp_light_time >>16) & 0xFF);          
                            g_RF_LoRa.rf_DataBuffer[37]          = (u8)((temp_light_time >>24) & 0xFF); //current //亮灯时长
                            
                            for (u16 i = 14; i <= 37; i++ )
                            {
                              g_RF_LoRa.rf_DataBuffer[i] += 0x33;
                            }
                            
                            g_RF_LoRa.rf_DataBuffer[38]           = getSum(g_RF_LoRa.rf_DataBuffer, 10 + g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT]); //cs
                            g_RF_LoRa.rf_DataBuffer[39]           = 0x16;                   //end
                            
                            MemCpy( &g_RF_LoRa.rf_DataBuffer[40], info_sourceadd,  6);      //信息域
                      
                            MemCpy( &g_RF_LoRa.rf_DataBuffer[46], info_sourceadd + 12,  6); //信息域
                      
                            MemCpy( &g_RF_LoRa.rf_DataBuffer[52], info_sourceadd + 6,  6);  //信息域
                            
                            SX1276LoRa_Send_Packet(g_RF_LoRa.rf_DataBuffer, g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 12 + 18);
                        }
                    }
                    
                  break;

                  default:
                    
                  break;
              }
          }
         
       }
     }
  }
  
}



/*****************************************************************************
由参数传递数据，PHY_data_indication定义在NWK层，
但是由PHY层调用，PHY_data_indication定义中表明需要的数据由PHY层由参数提供
******************************************************************************/
void PHY_data_indication(u8 * buf, u16 length)
{
    //NWK_data_indication(buf, length);
}


/*****************************************************************************
 Prototype    : hal_RF_process
 Description  : 无线驱动进程
 Date         : 2014/3/15
 Author       : Barry
*****************************************************************************/
/* 尽量将etimer 绑定在事件中，在事件中定义 */
PROCESS(hal_RF_process, "radio_process ");

#ifdef USE_LORA_MODE
PROCESS_THREAD(hal_RF_process, ev, data)
{
  PROCESS_BEGIN();
  
  while(1)
  {
    PROCESS_WAIT_EVENT(); 

    if (ev == PROCESS_EVENT_MSG)
    {
        if (*((tRFLRStates*)data) == RFLR_STATE_TX_RUNNING)   
        {
            etimer_set(&timer_rf, CLOCK_CONF_SECOND*4);                 //超时时间还需要调整
            printf("tx start\r\n");
        }
        else if (*((tRFLRStates*)data) == RFLR_STATE_TX_DONE)  
        {
           //etimer_stop(&timer_rf);                                    //此处如果不在中断函数中处理，就要在进程函数中处理
           SX1276LoRa_Receive_Packet(false);
           printf("tx done\r\n");
        }
        else  if (*((tRFLRStates*)data) == RFLR_STATE_RX_RECEIVEING) 
        {
           etimer_set(&timer_rf, CLOCK_CONF_SECOND*4);                  //超时时间还需要调整
           printf("rx start\r\n");
        } 
        else if (*((tRFLRStates*)data) == RFLR_STATE_RX_ERR)
        {
           SX1276LoRa_Receive_Packet(false); 
           printf("CRC error\r\n");
        }
        else if (*((tRFLRStates*)data) == RFLR_STATE_RX_DONE) 
        {
           SX1276LoRa_Receive_Packet(false); 
           
           printf("rssi = %f  snr = %d\r\n",SX1276LoRaGetPacketRssi(), SX1276LoRaGetPacketSnr());
           
           for (u8 i = 0; i < g_RF_LoRa.rf_RxPacketSize; i++)
           {
              printf("%X ",g_RF_LoRa.rf_DataBuffer[i]);
           }
           printf("\r\n");
         
          if (g_RF_LoRa.rf_DataBufferValid)
          {
              //etimer_stop(&timer_rf);                                 //此处如果不在中断函数中处理，就要在进程函数中处理
              hal_ToggleLED(TXD_LED);
              g_RF_LoRa.rf_DataBufferValid = false;
              apl_ProcessRadioCmd();
          }
        }
    }
    else if (ev == PROCESS_EVENT_TIMER)
    {
       if ((struct etimer *)data == &timer_rf)
       {
         if (SX1276LoRaGetRFState() == RFLR_STATE_TX_RUNNING)   
         {
            printf("tx time out\r\n");
         }
         if (SX1276LoRaGetRFState() ==  RFLR_STATE_RX_RECEIVEING)
         {
            printf("rx time out\r\n");
         }  
         hal_sRF_InitSPI();
         SX1276LoRa_Receive_Packet(false);
       }
    }
 }
 PROCESS_END();
}
#else
  
PROCESS_THREAD(hal_RF_process, ev, data)
{
  PROCESS_BEGIN();

  while(1)
  {
    PROCESS_WAIT_EVENT(); 

    if (ev == PROCESS_EVENT_MSG)
    {
        if (*((tRFStates*)data) == RF_STATE_TX_RUNNING)   
        {
            printf("tx start\r\n");
        }
        else if (*((tRFStates*)data) == RF_STATE_TX_DONE)  
        {
           printf("tx done\r\n");
           SX1276Fsk_recrive_Packet();
        }
        else  if (*((tRFStates*)data) == RF_STATE_RX_PREAMBLE) 
        {
            printf("rx start\r\n");
            etimer_set(&timer_rf, CLOCK_CONF_SECOND*4);
        }
        else if (*((tRFStates*)data) == RF_STATE_RX_DONE) 
        {
           printf("rx done\r\n");
           printf("rssi = %f\r\n",g_fsk.rssi);
           for (u8 i = 0; i < g_fsk.packetLenth; i++ )
           {
              printf("%d ",g_fsk.buffer[i]);
           }
           printf("\r\n");
           SX1276Fsk_recrive_Packet();
        }
    }
    else if (ev == PROCESS_EVENT_TIMER)
    {
         if ((struct etimer *)data == &timer_rf)
         {
           if (g_fsk.states == RF_STATE_TX_RUNNING)   
           {
              printf("tx time out\r\n");
           }
           else
           {
              hal_sRF_InitSPI();
              SX1276Fsk_recrive_Packet();
              printf("rx time out\r\n");
           }  
         }
       
